'''
from sys import *

setrecursionlimit(10**4)
def F(n):
    if n == 1:
        return 1
    if n > 1:
        return (3 * n + 5) * F(n - 1)
    if n< 1:
        print("test")


print(F(2073)/F(2070))'''

"""
ВТОРОЙ СПОСОБ
(восходящая или низходящая рекурсия, понять кто от ког зависит, должны как-то сократиться)

F(2073) = (3 * 2073 + 5) * F(2072) = (3 * 2073 + 5) * (3 * 2072 + 5) * F(2071)  = (3 * 2073 + 5) * (3 * 2072 + 5) * (3 * 2071 + 5) * F(2070)


"""
print((3 * 2073 + 5) * (3 * 2072 + 5) * (3 * 2071 + 5))
"""
ТРЕТИЙ СПОСОБ список
"""



arr = [0 for _ in range(0,5000)]
for n in range(1,5000): # низходящая от меньшего к большему
    if n == 1:
        arr[n] = 1
    elif n > 1:
        arr[n] = (3 * n + 5) * arr[n - 1]
print(arr[2073]/arr[2070])

"""
через словарь
"""

arr = dict()
for n in range(1,5000): # низходящая от меньшего к большему
    if n == 1:
        arr[n] = 1
    elif n > 1:
        arr[n] = (3 * n + 5) * arr[n - 1]
print(arr[2073]/arr[2070])